Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericSpacingTypeConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericSpacingTypeConvertor class provides a conversion extension method for Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericSpacingTypeConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType)
Converts a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType value to a Tekla.BIM.DirectManipulation.Services.Interaction.NumericSpacingType value.
dotSpacingType: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericSpacingType value to convert.
Returns: A Tekla.BIM.DirectManipulation.Services.Interaction.NumericSpacingType value.